{
  "quest_name": "Claw of the Savage Spirit (Beastlord Epic 1.0)",
  "steps": [
    {
      "step_number": 1,
      "description": "Go to Grimling Forest and speak to Captain Necin. Follow his dialogue and say 'ready to go'. Follow him to a camp and say 'ready to fight'. Kill all mobs at the camp until you get Copper Medal of War.",
      "npc": "Captain Necin",
      "location": "Grimling Forest",
      "item_received": "Copper Medal of War"
    },
    {
      "step_number": 2,
      "description": "Go to Shar Vhal and find Elder Animist Dumul. Give him Copper Medal of War to receive Official Seal of the Khati Sha and Carved Wooden Chest.",
      "npc": "Elder Animist Dumul",
      "location": "Shar Vhal",
      "items_received": ["Official Seal of the Khati Sha", "Carved Wooden Chest"]
    },
    {
      "step_number": 3,
      "description": "Go to Emerald Jungle and find Scout Vyrak. Give him Official Seal of the Khati Sha to spawn The Spirit of Rage. Kill it and loot Totem of the Gorilla. Give Totem of the Gorilla to Scout Vyrak to receive Wrapped Gorilla Totem.",
      "npc": "Scout Vyrak",
      "location": "Emerald Jungle",
      "items_received": ["Totem of the Gorilla", "Wrapped Gorilla Totem"]
    },
    {
      "step_number": 4,
      "description": "Go to Permafrost and find Scout Janomin. Give him Official Seal of the Khati Sha to spawn The Icebound Spirit. Kill it and loot Totem of the Ice Bear. Give Totem of the Ice Bear to Scout Janomin to receive Wrapped Ice Bear Totem.",
      "npc": "Scout Janomin",
      "location": "Permafrost",
      "items_received": ["Totem of the Ice Bear", "Wrapped Ice Bear Totem"]
    },
    {
      "step_number": 5,
      "description": "Go to Feerrott and find Scout Ahlikal. Give him Official Seal of the Khati Sha to spawn The Spirit of Decay. Kill it and loot Totem of the Spider. Give Totem of the Spider to Scout Ahlikal to receive Wrapped Spider Totem.",
      "npc": "Scout Ahlikal",
      "location": "Feerrott",
      "items_received": ["Totem of the Spider", "Wrapped Spider Totem"]
    },
    {
      "step_number": 6,
      "description": "Go to Lesser Faydark and find Scout Rahjiq. Give him Official Seal of the Khati Sha to spawn The Spirit of Malevolence. Kill it and loot Totem of the Wolf. Give Totem of the Wolf to Scout Rahjiq to receive Wrapped Wolf Totem.",
      "npc": "Scout Rahjiq",
      "location": "Lesser Faydark",
      "items_received": ["Totem of the Wolf", "Wrapped Wolf Totem"]
    },
    {
      "step_number": 7,
      "description": "Go to Stonebrunt Mountains and find Scout Malom. Give him Official Seal of the Khati Sha to spawn The Spirit of Torment. Kill it and loot Totem of the Watcher. Give Totem of the Watcher to Scout Malom to receive Wrapped Watcher Totem.",
      "npc": "Scout Malom",
      "location": "Stonebrunt Mountains",
      "items_received": ["Totem of the Watcher", "Wrapped Watcher Totem"]
    },
    {
      "step_number": 8,
      "description": "Give Sealed Gilded Wooden Chest to Elder Animist Dumul in Shar Vhal to receive your 1.0 Epic: Claw of the Savage Spirit.",
      "npc": "Elder Animist Dumul",
      "location": "Shar Vhal",
      "item_received": "Claw of the Savage Spirit"
    }
  ]
}
